app/Controllers/Administrador.php

    public function detalle($id_informe)
    {
        // Validar sesión
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        // Validar permisos de administrador
        if ($this->session->adm == '0') {
            return redirect()->to(base_url() . '/inicio/land');
        }
        $idUnidad = $this->informesGobierno
            ->where('id_informe', $id_informe)
            ->first();
        $unidad = $idUnidad['id_unidad'] ?? null;

        $unidad = $this->unidades
            ->where('id_unidad', $unidad)
            ->first();

        $dataInforme = $this->informesGobierno
            ->where('id_informe', $id_informe)
            ->first();
---
SELECT `informes_gobierno`.*, `usuarios`.`nombre_s`, `usuarios`.`apellido_p`, `usuarios`.`apellido_m`, `usuarios`.`usuario`, `etapas`.`numero_etapa`, `periodos_anuales`.`anio`
FROM `informes_gobierno`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `informes_gobierno`.`id_usuario`
LEFT JOIN `etapas` ON `etapas`.`id_etapa` = `informes_gobierno`.`id_etapa`
LEFT JOIN `periodos_anuales` ON `periodos_anuales`.`id_periodo_anual` = `informes_gobierno`.`id_periodo_anual`
WHERE `informes_gobierno`.`id_informe` = '16'
ORDER BY `informes_gobierno`.`created_at` DESC