app/Controllers/Administrador.php

    public function historiaEvaluacion($activo = 1)
    {

        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        if ((($this->session->adm) == '0')) {
            return redirect()->to(base_url() . '/inicio/land');
        }
        $current = 'Registro de Evaluaciones';
        // Obtén el último período para mostrarlo en la vista, si es necesario
        $lastPeriodo = $this->periodos->select('id_periodo, nombre_periodo')
            ->orderBy('id_periodo', 'DESC')
            ->first();
---
SELECT `id_periodo`, `nombre_periodo`
FROM `periodos`
ORDER BY `id_periodo` DESC
 LIMIT 1

    public function detalle($id_informe)
    {
        // Validar sesión
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        // Validar permisos de administrador
        if ($this->session->adm == '0') {
            return redirect()->to(base_url() . '/inicio/land');
        }
        $idUnidad = $this->informesGobierno
            ->where('id_informe', $id_informe)
            ->first();
        $unidad = $idUnidad['id_unidad'] ?? null;

        $unidad = $this->unidades
            ->where('id_unidad', $unidad)
            ->first();
---
SELECT *
FROM `informes_gobierno`
WHERE `id_informe` = '16'
 LIMIT 1
SELECT *
FROM `unidades`
WHERE `id_unidad` = '11'
 LIMIT 1

        $db = \Config\Database::connect();

        // Obtener información del periodo anual
        $periodoAnual = $this->periodosAnuales
            ->where('estado', 'activo')
            ->first();
---
SELECT *
FROM `periodos_anuales`
WHERE `estado` = 'activo'
 LIMIT 1

    public function finalizarEtapa()
    {
        //  Validar sesión y permisos
        if (!isset($this->session->id_usuario) || $this->session->adm == '0') {
            return redirect()->to(base_url());
        }
        //  Buscar la etapa actualmente abierta
        $etapaAbierta = $this->etapas
            ->where('estado', 'abierta')
            ->first();
        $anio = $this->periodosAnuales
            ->where('estado', 'activo')
            ->first();
---
SELECT *
FROM `periodos_anuales`
WHERE `estado` = 'activo'
 LIMIT 1

    public function obtenerComentarios()
    {
        // Validar sesión
        if (!isset($this->session->id_usuario)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Sesión no válida']);
        }

        $id_informe = $this->request->getGet('id_informe');
        $campo_referencia = $this->request->getGet('campo_referencia');

        if (empty($id_informe)) {
            return $this->response->setJSON(['success' => false, 'message' => 'ID de informe requerido']);
        }

        $db = \Config\Database::connect();
        $builder = $db->table('informe_comentarios');
        $builder->select('informe_comentarios.*, usuarios.nombre_s, usuarios.apellido_p, usuarios.apellido_m');
        $builder->join('usuarios', 'usuarios.id_usuario = informe_comentarios.id_usuario', 'left');
        $builder->where('informe_comentarios.id_informe', $id_informe);

        if ($campo_referencia) {
            $builder->where('informe_comentarios.campo_referencia', $campo_referencia);
        }

        $builder->orderBy('informe_comentarios.created_at', 'DESC');
        $comentarios = $builder->get()->getResultArray();
---
SELECT `informe_comentarios`.*, `usuarios`.`nombre_s`, `usuarios`.`apellido_p`, `usuarios`.`apellido_m`
FROM `informe_comentarios`
LEFT JOIN `usuarios` ON `usuarios`.`id_usuario` = `informe_comentarios`.`id_usuario`
WHERE `informe_comentarios`.`id_informe` = '16'
ORDER BY `informe_comentarios`.`created_at` DESC

    public function enviarNotificaciones($id_informe)
    {
        // Validar sesión
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        // Validar permisos de administrador
        if ($this->session->adm == '0') {
            return redirect()->to(base_url() . '/inicio/land');
        }
        $informesRegistrado = $this->informesGobierno->where('id_informe', $id_informe)->first();
        if (!$informesRegistrado) {
            return redirect()->back()->with('mensaje', 'Informe no encontrado');
        }
        $datosUsario = $this->usuarios->where('id_usuario', $informesRegistrado['id_usuario'])->first();
---
SELECT *
FROM `informes_gobierno`
WHERE `id_informe` = '16'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1598'
 LIMIT 1

    public function finalizarGlosa()
    {
        // Validar sesión y permisos
        if (!isset($this->session->id_usuario) || $this->session->adm == '0') {
            return redirect()->to(base_url());
        }

        // Buscar la glosa actualmente abierta
        $glosaAbierta = $this->glosaGestion
            ->where('estado', 'abierta')
            ->first();

        if (!$glosaAbierta) {
            return redirect()->back()
                ->with('mensaje', 'No hay ninguna glosa abierta para finalizar.');
        }

        // Cerrar la glosa
        $this->glosaGestion
            ->where('id_glosa', $glosaAbierta['id_glosa'])
            ->set([
                'estado' => 'cerrada',
                'fecha_cierre_real' => date('Y-m-d')
            ])
            ->update();


        //  Opcional: bloquear glosa a usuarios
        $this->usuarios
            ->where('loadglosa', 1)
            ->set(['glosa' => 0])
            ->update();
---
SELECT *
FROM `glosa_gestion`
WHERE `estado` = 'abierta'
 LIMIT 1
UPDATE `glosa_gestion` SET `estado` = 'cerrada', `fecha_cierre_real` = '2026-02-18'
WHERE `id_glosa` = '3'
UPDATE `usuarios` SET `glosa` = 0
WHERE `loadglosa` = 1