app/Controllers/Inicio.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'admin'
AND `activo` = 1
 LIMIT 1
UPDATE `usuarios` SET `fecha_ultimo_acceso` = '2026-02-09 11:49:34'
WHERE `usuarios`.`id_usuario` IN ('1')
---
        function test_input($data) {
            $data = trim($data);
            $data = stripslashes($data);
            $data = htmlspecialchars($data);
            return $data;
        }
        if($this->request->getMethod()== "post" && $this->validate($this->reglasLogin)){
            $password=test_input($this->request->getPost('password'));
            $usuario=test_input($this->request->getPost('usuario'));
            $datosusuario=$this->usuarios->where(['usuario'=>$usuario, 'activo'=>1])->first();

            if($datosusuario!=null){
                if(password_verify($password, $datosusuario['password'])){
                    $datosSesion=[
                    'usuario'=>$datosusuario['usuario'],
                    'id_usuario'=>$datosusuario['id_usuario'],
                    'id_unidad'=>$datosusuario['id_unidad'],
                    'nombre_s'=>$datosusuario['nombre_s'],
                    'apellido_p'=>$datosusuario['apellido_p'],
                    'apellido_m'=>$datosusuario['apellido_m'],
                    'admGen'=>$datosusuario['admGen'],
                    'adm'=>$datosusuario['adm'],
                    'fecha_ultimo_acceso'=>$datosusuario['fecha_ultimo_acceso'],
                    'c_acceso'=>date('Y-m-d H:i:s'),
                    'correo'=>$datosusuario['correo'],
                    //'scii'=>$datosusuario['scii']
                    ];
                    $session=session();
                    $session->set($datosSesion);
                    $this->usuarios->update($session->id_usuario,['fecha_ultimo_acceso'=>$session->c_acceso]);

UPDATE `usuarios` SET `fecha_ultimo_acceso` = '2026-02-10 16:54:23'
WHERE `usuarios`.`id_usuario` IN ('1598')
---
    public function logout(){
        if(!isset($this->session->id_usuario)){ return redirect()->to(base_url().'/inicio');}
        $session=session();
        $this->usuarios->update($session->id_usuario,['fecha_ultimo_acceso'=>$session->c_acceso]);