app/Controllers/Scii.php

SELECT *
FROM `periodos_anuales`
WHERE `estado` = 'activo'
 LIMIT 1
---
    public function informe($id_informe = null)
    {
        $estadoPeriodo = $this->periodosAnuales->where('estado', 'activo')->first();