app/Controllers/Scii.php

    public function inicio()
    {
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        $id_usuario = $this->session->id_usuario;
        $datos = $this->usuarios->where('id_usuario', $id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1598'
 LIMIT 1

    public function respuestas($id_respuesta)
    {
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        $id_usuario = $this->session->id_usuario;
        $datos = $this->usuarios->where('id_usuario', $id_usuario)->first();
        $id_unidad = $datos['id_unidad'];
        //Obtenemos las respuestas
        $respuestas = $this->respuestas->where('id_respuesta', $id_respuesta)->first();
        $id = $respuestas['id_evaluacion'];
        $idPeriodo = $respuestas['id_periodo'];
        //Obtnemos el id del usuario evaluado y sus datos
        $id_usuario = $respuestas['id_usuario'];
        $datosEvaluado = $this->usuarios->where('id_usuario', $id_usuario)->first();
        $expediente = $datosEvaluado['usuario'];
        $nombreCompleto = $datosEvaluado['nombre_s'] . ' ' . $datosEvaluado['apellido_p'] . ' ' . $datosEvaluado['apellido_m'];
        $idCategoria = $datosEvaluado['id_categoria'];
        $categoria = $this->categorias->where('id_categoria', $idCategoria)->first();
        $nombreCategoria = $categoria['nombre_categoria'];
        $unidad = $this->unidades->where('id_unidad', $id_unidad)->first();
---
SELECT *
FROM `unidades`
WHERE `id_unidad` = '11'
 LIMIT 1

    public function informe($id_informe = null)
    {
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        $usuario = $this->usuarios->where([
            'id_usuario'  => $this->session->id_usuario,
            'loadinforme' => 1,
            'informe'     => 1
        ])->first();
        if (!$usuario) {
            return redirect()->to(base_url('scii/inicio/'))
                ->with('mensaje', 'No tienes acceso a esta sección.');
        }
        $lineasModel = new LineasAccionModel();
        $lineas = $lineasModel->getLineasAccionConContexto();
        $lineasSocioambientalModel = new LineasAccionSocioambientalModel();
        $lineasSocioambiental = $lineasSocioambientalModel->getLineasAccionConContexto();
        $lineasAguaModel = new LineasAccionAguaModel();
        $lineasAgua = $lineasAguaModel->getLineasAccionConContexto();
        $odsTemasModel = new OdsTemasModel();
        $odsTemas = $odsTemasModel->getODS();
        $periodoAnualActivo = $this->periodosAnuales
            ->where('estado', 'activo')
            ->first();
        $idPeriodoActivo = $periodoAnualActivo['id_periodo_anual'];
        $etapaActiva = $this->etapas
            ->where('estado', 'abierta')
            ->first();
        $idEtapaActiva = $etapaActiva['id_etapa'];
        $id_unidad = $usuario['id_unidad'];
        $unidad = $this->unidades->where('id_unidad', $id_unidad)->first();
        $usuario['nombre_unidad'] = $unidad['descripcion'];
        $periodoAnual = $this->periodosAnuales->where('estado', 'activo')->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1598'
AND `loadinforme` = 1
AND `informe` = 1
 LIMIT 1
SELECT *
FROM `periodos_anuales`
WHERE `estado` = 'activo'
 LIMIT 1
SELECT *
FROM `etapas`
WHERE `estado` = 'abierta'
 LIMIT 1
SELECT *
FROM `unidades`
WHERE `id_unidad` = '11'
 LIMIT 1

        }

        if ($id_informe !== NULL) {
            $informesGobierno = $this->informesGobierno->where('id_informe', $id_informe)->first();
---
SELECT *
FROM `informes_gobierno`
WHERE `id_informe` = '16'
 LIMIT 1

    private function crearInforme()
    {
        $db = \Config\Database::connect();
        try {
            // Iniciar transacción
            $db->transStart();
            $id_usuario = $this->session->id_usuario;
            $id_unidad = $this->session->id_unidad;
            $id_etapa = $this->etapas->where('estado', 'abierta')->first()['id_etapa'];
            $id_periodo_actual = $this->periodosAnuales->where('estado', 'activo')->first()['id_periodo_anual'];
---
SELECT *
FROM `etapas`
WHERE `estado` = 'abierta'
 LIMIT 1
SELECT *
FROM `periodos_anuales`
WHERE `estado` = 'activo'
 LIMIT 1

                            'estado' => 'activo'
                        ];

                        $archivoInsertResult = $this->informeArchivos->insert($archivoData);
---
INSERT INTO `informe_archivos` (`id_informe`, `tipo_archivo`, `nombre_archivo`, `nombre_original`, `ruta_archivo`, `extension`, `tamanio_kb`, `mime_type`, `orden`, `estado`, `created_at`, `updated_at`) VALUES (20, 'mapa', '69973de4eac20_8f4683d1e6c74ef99b8b.xlsx', 'Oficina de la Secretaria.xlsx', 'http://localhost/sciismadsot.puebla.gob.mx/public/uploads/informes/20/mapas/69973de4eac20_8f4683d1e6c74ef99b8b.xlsx', 'xlsx', 17.69, 'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet', 1, 'activo', '2026-02-19 10:44:20', '2026-02-19 10:44:20')

    public function obtenerComentarios()
    {
        // Validar sesión
        if (!isset($this->session->id_usuario)) {
            return redirect()->to(base_url());
        }
        // Valida que tenga permisos para accerder al informe.
        $usuario = $this->usuarios->where([
            'id_usuario'  => $this->session->id_usuario,
            'loadinforme' => 1,
            'informe'     => 1
        ])->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1598'
AND `loadinforme` = 1
AND `informe` = 1
 LIMIT 1