app/Models/LineasAccionInformeModel.php

    public function getLineasAccionPorPrograma($programaId)
    {
        return $this->db->table('lineas_accion_informe la')
            ->select('
                la.id,
                la.codigo,
                la.descripcion,
                es.codigo AS estrategia,
                o.codigo AS objetivo,
                t.codigo AS tematica,
                e.codigo AS eje,
                ps.codigo AS programa_sectorial
            ')
            ->join('estrategias_informe es', 'es.id = la.estrategia_id')
            ->join('objetivos_informe o', 'o.id = es.objetivo_id')
            ->join('tematicas_informe t', 't.id = o.tematica_id')
            ->join('ejes_informe e', 'e.id = t.eje_id')
            ->join('programas_sectoriales_informe ps', 'ps.id = e.programa_id')
            ->where('ps.id', $programaId)
            ->orderBy('la.codigo', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `la`.`id`, `la`.`codigo`, `la`.`descripcion`, `es`.`codigo` AS `estrategia`, `o`.`codigo` AS `objetivo`, `t`.`codigo` AS `tematica`, `e`.`codigo` AS `eje`, `ps`.`codigo` AS `programa_sectorial`
FROM `lineas_accion_informe` `la`
JOIN `estrategias_informe` `es` ON `es`.`id` = `la`.`estrategia_id`
JOIN `objetivos_informe` `o` ON `o`.`id` = `es`.`objetivo_id`
JOIN `tematicas_informe` `t` ON `t`.`id` = `o`.`tematica_id`
JOIN `ejes_informe` `e` ON `e`.`id` = `t`.`eje_id`
JOIN `programas_sectoriales_informe` `ps` ON `ps`.`id` = `e`.`programa_id`
WHERE `ps`.`id` = 2
ORDER BY `la`.`codigo` ASC