app/Models/LineasAccionModel.php

SELECT `la`.`id`, `la`.`codigo`, `la`.`descripcion`, `es`.`codigo` AS `estrategia`, `o`.`codigo` AS `objetivo`, `t`.`codigo` AS `tematica`, `e`.`codigo` AS `eje`
FROM `lineas_accion` `la`
JOIN `estrategias` `es` ON `es`.`id` = `la`.`estrategia_id`
JOIN `objetivos` `o` ON `o`.`id` = `es`.`objetivo_id`
JOIN `tematicas` `t` ON `t`.`id` = `o`.`tematica_id`
JOIN `ejes` `e` ON `e`.`id` = `t`.`eje_id`
ORDER BY `la`.`codigo` ASC
---
    public function getLineasAccionConContexto()
    {
        return $this->db->table('lineas_accion la')
            ->select('
            la.id,
            la.codigo,
            la.descripcion,
            es.codigo AS estrategia,
            o.codigo AS objetivo,
            t.codigo AS tematica,
            e.codigo AS eje
        ')
            ->join('estrategias es', 'es.id = la.estrategia_id')
            ->join('objetivos o', 'o.id = es.objetivo_id')
            ->join('tematicas t', 't.id = o.tematica_id')
            ->join('ejes e', 'e.id = t.eje_id')
            ->orderBy('la.codigo', 'ASC')
            ->get()
            ->getResultArray();