app/Models/LineasAccionAguaModel.php

SELECT `la`.`id`, `la`.`codigo`, `la`.`descripcion`, `es`.`codigo` AS `estrategia`, `o`.`codigo` AS `objetivo`, `t`.`codigo` AS `tematica`, `e`.`codigo` AS `eje`
FROM `lineas_accion_agua` `la`
JOIN `estrategias_agua` `es` ON `es`.`id` = `la`.`estrategia_id`
JOIN `objetivos_agua` `o` ON `o`.`id` = `es`.`objetivo_id`
JOIN `tematicas_agua` `t` ON `t`.`id` = `o`.`tematica_id`
JOIN `ejes_agua` `e` ON `e`.`id` = `t`.`eje_id`
ORDER BY `la`.`codigo` ASC
---
    public function getLineasAccionConContexto()
    {
        return $this->db->table('lineas_accion_agua la')
            ->select('
            la.id,
            la.codigo,
            la.descripcion,
            es.codigo AS estrategia,
            o.codigo AS objetivo,
            t.codigo AS tematica,
            e.codigo AS eje
        ')
            ->join('estrategias_agua es', 'es.id = la.estrategia_id')
            ->join('objetivos_agua o', 'o.id = es.objetivo_id')
            ->join('tematicas_agua t', 't.id = o.tematica_id')
            ->join('ejes_agua e', 'e.id = t.eje_id')
            ->orderBy('la.codigo', 'ASC')
            ->get()
            ->getResultArray();