app/Models/LineasAccionSocioambientalModel.php

    public function getLineasAccionConContexto()
    {
        return $this->db->table('lineas_accion_socioambiental la')
            ->select('
            la.id,
            la.codigo,
            la.descripcion,
            es.codigo AS estrategia,
            o.codigo AS objetivo,
            t.codigo AS tematica,
            e.codigo AS eje
        ')
            ->join('estrategias_socioambiental es', 'es.id = la.estrategia_id')
            ->join('objetivos_socioambiental o', 'o.id = es.objetivo_id')
            ->join('tematicas_socioambiental t', 't.id = o.tematica_id')
            ->join('ejes_socioambiental e', 'e.id = t.eje_id')
            ->orderBy('la.codigo', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `la`.`id`, `la`.`codigo`, `la`.`descripcion`, `es`.`codigo` AS `estrategia`, `o`.`codigo` AS `objetivo`, `t`.`codigo` AS `tematica`, `e`.`codigo` AS `eje`
FROM `lineas_accion_socioambiental` `la`
JOIN `estrategias_socioambiental` `es` ON `es`.`id` = `la`.`estrategia_id`
JOIN `objetivos_socioambiental` `o` ON `o`.`id` = `es`.`objetivo_id`
JOIN `tematicas_socioambiental` `t` ON `t`.`id` = `o`.`tematica_id`
JOIN `ejes_socioambiental` `e` ON `e`.`id` = `t`.`eje_id`
ORDER BY `la`.`codigo` ASC