app/Models/OdsTemasModel.php

SELECT `t`.`id_tema`, `t`.`tema`, `m`.`id_meta`, `m`.`codigo_meta`, `o`.`id_objetivo`, `o`.`nombre` AS `objetivo`, `o`.`descripcion` AS `descripcion`
FROM `ods_temas` `t`
JOIN `ods_metas` `m` ON `t`.`id_meta` = `m`.`id_meta`
JOIN `ods_objetivos` `o` ON `m`.`id_objetivo` = `o`.`id_objetivo`
ORDER BY `o`.`id_objetivo`, `m`.`codigo_meta`, `t`.`id_tema`
---
    public function getODS()
    {
        return $this->db->table('ods_temas t')
            ->select('
                t.id_tema,
                t.tema,
                m.id_meta,
                m.codigo_meta,
                o.id_objetivo,
                o.nombre AS objetivo,
                o.descripcion AS descripcion
            ')
            ->join('ods_metas m', 't.id_meta = m.id_meta')
            ->join('ods_objetivos o', 'm.id_objetivo = o.id_objetivo')
            ->orderBy('o.id_objetivo, m.codigo_meta, t.id_tema')
            ->get()
            ->getResultArray();